Ramla-I/hal_agent/devices/nxp/s32k1xx/svd/s32k148.svd
        <register>
          <name>TCD5_BITER_ELINKYES</name>
          <description>TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)</description>
          <alternateGroup>DMA</alternateGroup>
          <addressOffset>0x10BE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>BITER</name>
              <description>Starting major iteration count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINKCH</name>
              <description>Link Channel Number</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELINK</name>
              <description>Enables channel-to-channel linking on minor loop complete</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The channel-to-channel linking is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The channel-to-channel linking is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_SADDR</name>
          <description>TCD Source Address</description>
          <addressOffset>0x10C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>Source Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_SOFF</name>
          <description>TCD Signed Source Address Offset</description>
          <addressOffset>0x10C4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SOFF</name>
              <description>Source address signed offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_ATTR</name>
          <description>TCD Transfer Attributes</description>
          <addressOffset>0x10C6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DSIZE</name>
              <description>Destination data transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMOD</name>
              <description>Destination Address Modulo</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSIZE</name>
              <description>Source data transfer size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>8-bit</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>16-bit</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>32-bit</description>
                  <value>#010</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMOD</name>
              <description>Source Address Modulo</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Source address modulo feature is disabled</description>
                  <value>#00000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_NBYTES_MLNO</name>
          <description>TCD Minor Byte Count (Minor Loop Mapping Disabled)</description>
          <alternateGroup>DMA</alternateGroup>
          <addressOffset>0x10C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>NBYTES</name>
              <description>Minor Byte Transfer Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_NBYTES_MLOFFNO</name>
          <description>TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)</description>
          <alternateGroup>DMA</alternateGroup>
          <addressOffset>0x10C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>NBYTES</name>
              <description>Minor Byte Transfer Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMLOE</name>
              <description>Destination Minor Loop Offset enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The minor loop offset is not applied to the DADDR</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The minor loop offset is applied to the DADDR</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMLOE</name>
              <description>Source Minor Loop Offset Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The minor loop offset is not applied to the SADDR</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The minor loop offset is applied to the SADDR</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_NBYTES_MLOFFYES</name>
          <description>TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)</description>
          <alternateGroup>DMA</alternateGroup>
          <addressOffset>0x10C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>NBYTES</name>
              <description>Minor Byte Transfer Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLOFF</name>
              <description>If SMLOE or DMLOE is set, this field represents a sign-extended offset applied to the source or destination address to form the next-state value after the minor loop completes.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMLOE</name>
              <description>Destination Minor Loop Offset enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The minor loop offset is not applied to the DADDR</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The minor loop offset is applied to the DADDR</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMLOE</name>
              <description>Source Minor Loop Offset Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The minor loop offset is not applied to the SADDR</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The minor loop offset is applied to the SADDR</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_SLAST</name>
          <description>TCD Last Source Address Adjustment</description>
          <addressOffset>0x10CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SLAST</name>
              <description>Last Source Address Adjustment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_DADDR</name>
          <description>TCD Destination Address</description>
          <addressOffset>0x10D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DADDR</name>
              <description>Destination Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_DOFF</name>
          <description>TCD Signed Destination Address Offset</description>
          <addressOffset>0x10D4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DOFF</name>
              <description>Destination Address Signed Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_CITER_ELINKNO</name>
          <description>TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)</description>
          <alternateGroup>DMA</alternateGroup>
          <addressOffset>0x10D6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CITER</name>
              <description>Current Major Iteration Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELINK</name>
              <description>Enable channel-to-channel linking on minor-loop complete</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The channel-to-channel linking is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The channel-to-channel linking is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_CITER_ELINKYES</name>
          <description>TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)</description>
          <alternateGroup>DMA</alternateGroup>
          <addressOffset>0x10D6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CITER_LE</name>
              <description>Current Major Iteration Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINKCH</name>
              <description>Minor Loop Link Channel Number</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELINK</name>
              <description>Enable channel-to-channel linking on minor-loop complete</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The channel-to-channel linking is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The channel-to-channel linking is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD6_DLASTSGA</name>
          <description>TCD Last Destination Address Adjustment/Scatter Gather Address</description>
          <addressOffset>0x10D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DLASTSGA</name>
              <description>DLASTSGA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
