Ramla-I/hal_agent/devices/nxp/s32k1xx/svd/s32k148.svd
        <register>
          <name>NVICIP235</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x3EB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI235</name>
              <description>Priority of interrupt 235</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP236</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x3EC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI236</name>
              <description>Priority of interrupt 236</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP237</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x3ED</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI237</name>
              <description>Priority of interrupt 237</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP238</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x3EE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI238</name>
              <description>Priority of interrupt 238</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP239</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x3EF</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI239</name>
              <description>Priority of interrupt 239</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICSTIR</name>
          <description>Software Trigger Interrupt Register</description>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTID</name>
              <description>Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MCM</name>
      <description>Core Platform Miscellaneous Control Module</description>
      <prependToName>MCM_</prependToName>
      <baseAddress>0xE0080000</baseAddress>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4A0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MCM</name>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>PLASC</name>
          <description>Crossbar Switch (AXBS) Slave Configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ASC</name>
              <description>Each bit in the ASC field indicates whether there is a corresponding connection to the crossbar switch&apos;s slave input port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A bus slave connection to AXBS input port n is absent</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A bus slave connection to AXBS input port n is present</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLAMC</name>
          <description>Crossbar Switch (AXBS) Master Configuration</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>AMC</name>
              <description>Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A bus master connection to AXBS input port n is absent</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A bus master connection to AXBS input port n is present</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPCR</name>
          <description>Core Platform Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFAF</resetMask>
          <fields>
            <field>
              <name>HLT_FSM_ST</name>
              <description>AXBS Halt State Machine Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Waiting for request</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Waiting for platform idle</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Platform stalled</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Unused state</description>
                  <value>#10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_HLT_REQ</name>
              <description>AXBS Halt Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AXBS is not receiving halt request</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AXBS is receiving halt request</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_HLTD</name>
              <description>AXBS Halted</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>AXBS is not currently halted</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>AXBS is currently halted</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMC_PF_IDLE</name>
              <description>Flash Memory Controller Program Flash Idle</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FMC program flash is not idle</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>FMC program flash is currently idle</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PBRIDGE_IDLE</name>
              <description>Peripheral Bridge Idle</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PBRIDGE is not idle</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PBRIDGE is currently idle</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBRR</name>
              <description>Crossbar Round-robin Arbitration Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Fixed-priority arbitration</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Round-robin arbitration</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMUAP</name>
              <description>SRAM_U Arbitration Priority</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Round robin</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Special round robin (favors SRAM backdoor accesses over the processor)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Fixed priority. Processor has highest, backdoor has lowest</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Fixed priority. Backdoor has highest, processor has lowest</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMUWP</name>
              <description>SRAM_U Write Protect</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAMLAP</name>
              <description>SRAM_L Arbitration Priority</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Round robin</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Special round robin (favors SRAM backdoor accesses over the processor)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Fixed priority. Processor has highest, backdoor has lowest</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Fixed priority. Backdoor has highest, processor has lowest</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMLWP</name>
              <description>SRAM_L Write Protect</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
